aish/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type            symmetry;
    }
    top
    {
        type            symmetry;
    }
    walls
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    cyl0
    {
        type            zeroGradient;
    }
    cyl1
    {
        type            zeroGradient;
    }
    cyl2
    {
        type            zeroGradient;
    }
    cyl3
    {
        type            zeroGradient;
    }
    cyl4
    {
        type            zeroGradient;
    }
    cyl5
    {
        type            zeroGradient;
    }
    cyl6
    {
        type            zeroGradient;
    }
    cyl7
    {
        type            zeroGradient;
    }
    cyl8
    {
        type            zeroGradient;
    }
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
